app/controllers/api/books_controller.rb

SELECT "books".* FROM "books" WHERE (stock > 0)
---
    def show
      book = Book.where('stock > ?', 0)

INSERT INTO "books" ("code", "title", "author", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["code", "SHR-1"], ["title", "A Study in Scarlet"], ["author", "Arthur Conan Doyle"], ["stock", 1], ["created_at", "2024-08-10 06:57:16.508438"], ["updated_at", "2024-08-10 06:57:16.508438"]]
---
    def create
      book = Book.new(book_params)
      if book.save