app/controllers/api/members_controller.rb

    def show
      render json: Member.all, status: :ok
---
SELECT "members".* FROM "members"

    def create
      member = Member.new(member_param)
      if member.save
---
INSERT INTO "members" ("code", "name", "book_borrowed_count", "is_penalized", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["code", "M002"], ["name", "Ferry"], ["book_borrowed_count", 0], ["is_penalized", 0], ["created_at", "2024-08-10 06:25:30.804930"], ["updated_at", "2024-08-10 06:25:30.804930"]]

    def borrow
      if @member.present? && @book.present?
        borrow = BorrowBook.new(book: @book, member: @member)
        if borrow.save
---
INSERT INTO "borrow_books" ("book_id", "member_id", "deadline_book", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["member_id", 1], ["deadline_book", nil], ["created_at", "2024-08-10 05:48:08.409473"], ["updated_at", "2024-08-10 05:48:08.409473"]]

    def return_book
      borrow = BorrowBook.find_by(book: @book, member: @member)
      if borrow.present?
        if borrow.destroy
---
SELECT "borrow_books".* FROM "borrow_books" WHERE "borrow_books"."book_id" = ? AND "borrow_books"."member_id" = ? LIMIT ?  [["book_id", 1], ["member_id", 1], ["LIMIT", 1]]
DELETE FROM "borrow_books" WHERE "borrow_books"."id" = ?  [["id", 1]]

    def set_member_and_book
      @member = Member.find_by(code: params[:code_member])
      @book = Book.find_by(code: params[:code_book])
---
SELECT "members".* FROM "members" WHERE "members"."code" = ? LIMIT ?  [["code", "M002"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."code" = ? LIMIT ?  [["code", "TW-11"], ["LIMIT", 1]]