app/models/borrow_book.rb

UPDATE "books" SET "stock" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["stock", 0], ["updated_at", "2024-08-10 07:57:02.847736"], ["id", 3]]
UPDATE "books" SET "stock" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["stock", 1], ["updated_at", "2024-08-10 06:54:13.989581"], ["id", 1]]
UPDATE "members" SET "book_borrowed_count" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["book_borrowed_count", 1], ["updated_at", "2024-08-10 07:45:17.865480"], ["id", 1]]
---
  def after_borrow_update
    book.update(stock:0)
    member.update(book_borrowed_count: member.book_borrowed_count + 1)

UPDATE "books" SET "stock" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["stock", 1], ["updated_at", "2024-08-10 07:26:09.973434"], ["id", 1]]
UPDATE "members" SET "book_borrowed_count" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["book_borrowed_count", 0], ["updated_at", "2024-08-10 08:15:10.027807"], ["id", 2]]
UPDATE "books" SET "stock" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["stock", 1], ["updated_at", "2024-08-10 07:47:23.153110"], ["id", 1]]
---
  def after_return_update
    book.update(stock:1)
    member.update(book_borrowed_count: member.book_borrowed_count - 1)

UPDATE "members" SET "is_penalized" = ?, "updated_at" = ?, "penalty_until_date" = ? WHERE "members"."id" = ?  [["is_penalized", 0], ["updated_at", "2024-08-10 08:17:20.799627"], ["penalty_until_date", nil], ["id", 2]]
---
  def check_before_borrow
    errors.add(:base, 'Book is out of stock') if book.stock == 0
    errors.add(:base, 'Maximum 2 Borrowed Book every 1 Member') if member.book_borrowed_count==2
    if member.is_penalized
      if member.penalty_until_date.present? && member.penalty_until_date > Date.today
        errors.add(:base, 'Member is currently penalized and cannot borrow books until the penalty period is over.')
      else
        member.update(is_penalized: false, penalty_until_date: nil)

UPDATE "members" SET "is_penalized" = ?, "updated_at" = ?, "penalty_until_date" = ? WHERE "members"."id" = ?  [["is_penalized", 1], ["updated_at", "2024-08-10 08:15:10.019417"], ["penalty_until_date", "2024-08-11 08:15:10.017605"], ["id", 2]]
---
  def check_penalized
    member.update(is_penalized: true, penalty_until_date: DateTime.now + 3.day) if self.deadline_book < DateTime.now